app/views/brews/show.html.erb

	<h3>Ingredients</h3>
		<% @brew.fermentables.each do |fermentable| %>
---
SELECT "fermentables".* FROM "fermentables" WHERE "fermentables"."brew_id" = ?  [["brew_id", 36]]


		<% @brew.hops.each do |hop| %>
---
SELECT "hops".* FROM "hops" WHERE "hops"."brew_id" = ?  [["brew_id", 8]]


		<% @brew.yeasts.each do |yeasts| %>
---
SELECT "yeasts".* FROM "yeasts" WHERE "yeasts"."brew_id" = ?  [["brew_id", 36]]


		<% @brew.extras.each do |extras| %>
---
SELECT "extras".* FROM "extras" WHERE "extras"."brew_id" = ?  [["brew_id", 36]]