app/views/users/show.html.erb

<h1>Users#show</h1>
	<% @user.brews.each do |brew| %>
---
SELECT "brews".* FROM "brews" WHERE "brews"."user_id" = ?  [["user_id", 1]]