app/controllers/brews_controller.rb

SELECT "brews".* FROM "brews" ORDER BY created_at desc
---
  def index
  	@brews = Brew.order("created_at desc")

SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
  	@brew = Brew.find params[:id]

SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "37"]]
---
  def edit
    @brew = Brew.find params[:id]

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "brews" ("created_at", "name", "story", "updated_at", "user_id", "walkthrough") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 11 Jun 2013 16:07:24 UTC +00:00], ["name", "adfs"], ["story", "asdfa"], ["updated_at", Tue, 11 Jun 2013 16:07:24 UTC +00:00], ["user_id", 1], ["walkthrough", "asdfasdfasdf"]]
---
  def create
  	@brew = Brew.new(brew_params)
    @brew.user = User.find(current_user.id)
   	if @brew.save

SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "37"]]
UPDATE "brews" SET "story" = ?, "updated_at" = ? WHERE "brews"."id" = 4  [["story", "dafsdfasdfasdfa"], ["updated_at", Tue, 11 Jun 2013 15:07:58 UTC +00:00]]
---
 def update
  @brew = Brew.find params[:id]
  @brew.update brew_params

SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "brews" WHERE "brews"."id" = ?  [["id", 11]]
---
def destroy
    @brew = Brew.find params[:id]
    @brew.destroy